Repository: SloMR/PastePoint
Catalog: client/ios/PastePoint/Resources/Localization/Localizable.xcstrings
Source language: en
Languages: ar, es, fr, ru, zh_hans

# SERVER_RECONNECT_NOW
source: Reconnecting… · attempt %lld
ar: إعادة الاتصال… · المحاولة %lld
es: Reconectando… · intento %lld
fr: Reconnexion… · tentative %lld
ru: Переподключение… · попытка %lld
zh_hans: 正在重新连接… · 第 %lld 次尝试

# SERVER_RECONNECT_TITLE
source: Can't reach the server
ar: تعذّر الوصول إلى الخادم
es: No se puede contactar con el servidor
fr: Serveur injoignable
ru: Сервер недоступен
zh_hans: 无法连接到服务器

# SESSION_CODE_DESCRIPTION
source: Type the code shown on the other device.
ar: اكتب الرمز الظاهر على الجهاز الآخر.
es: Escribe el código que aparece en el otro dispositivo.
fr: Saisissez le code affiché sur l’autre appareil.
ru: Введите код, показанный на другом устройстве.
zh_hans: 输入另一台设备上显示的代码。

# SESSION_CODE_PLACEHOLDER
source: 10 letters or numbers
ar: 10 أحرف أو أرقام
es: 10 letras o números
fr: 10 lettres ou chiffres
ru: 10 букв или цифр
zh_hans: 10 位字母或数字

# SESSION_JOIN_FAILED
source: Couldn’t join — the code may be wrong or expired. You’re back on your Wi-Fi.
ar: تعذّر الانضمام — قد يكون الرمز خاطئًا أو منتهي الصلاحية. عدت إلى شبكتك.
es: No se pudo unir: el código puede ser incorrecto o haber caducado. Has vuelto a tu Wi-Fi.
fr: Impossible de rejoindre — le code est peut-être incorrect ou expiré. Vous êtes de retour sur votre Wi-Fi.
ru: Не удалось подключиться — код неверный или устарел. Вы вернулись в свою сеть Wi-Fi.
zh_hans: 无法加入 — 代码可能有误或已过期。你已回到自己的 Wi-Fi。

# SESSION_STATUS_PRIVATE
source: Invite-only · %lld devices
ar: بدعوة فقط · %lld أجهزة
es: Solo por invitación · %lld dispositivos
fr: Sur invitation · %lld appareils
ru: Только по приглашению · устройств: %lld
zh_hans: 仅限邀请 · %lld 台设备

# SESSION_STATUS_PRIVATE_ALONE
source: Invite-only · just you
ar: بدعوة فقط · أنت فقط
es: Solo por invitación · solo tú
fr: Sur invitation · vous seulement
ru: Только по приглашению · только вы
zh_hans: 仅限邀请 · 只有你

# SESSION_STATUS_WIFI
source: On this Wi-Fi · %lld devices
ar: على هذه الشبكة · %lld أجهزة
es: En esta Wi-Fi · %lld dispositivos
fr: Sur ce Wi-Fi · %lld appareils
ru: В этой сети Wi-Fi · устройств: %lld
zh_hans: 同一 Wi-Fi · %lld 台设备

# SESSION_STATUS_WIFI_ALONE
source: On this Wi-Fi · just you
ar: على هذه الشبكة · أنت فقط
es: En esta Wi-Fi · solo tú
fr: Sur ce Wi-Fi · vous seulement
ru: В этой сети Wi-Fi · только вы
zh_hans: 同一 Wi-Fi · 只有你

source: Settings
ar: الإعدادات
es: Ajustes
fr: Réglages
ru: Настройки
zh_hans: 设置

source: Share
ar: مشاركة
es: Compartir
fr: Partager
ru: Поделиться
zh_hans: 分享

source: Share invite
ar: مشاركة الدعوة
es: Compartir invitación
fr: Partager l’invitation
ru: Поделиться приглашением
zh_hans: 分享邀请

# START_PRIVATE_FAILED
source: Couldn’t create the link. Try again.
ar: تعذّر إنشاء الرابط. حاول مرة أخرى.
es: No se pudo crear el enlace. Inténtalo de nuevo.
fr: Impossible de créer le lien. Réessayez.
ru: Не удалось создать ссылку. Попробуйте ещё раз.
zh_hans: 无法创建链接。请重试。

source: Starting…
ar: جارٍ البدء…
es: Iniciando…
fr: Démarrage…
ru: Запуск…
zh_hans: 启动中…

source: Switch appearance
ar: تبديل المظهر
es: Cambiar apariencia
fr: Changer l'apparence
ru: Сменить оформление
zh_hans: 切换外观

source: Take Photo or Video
ar: التقاط صورة أو فيديو
es: Tomar foto o vídeo
fr: Prendre une photo ou une vidéo
ru: Снять фото или видео
zh_hans: 拍摄照片或视频

source: Tap to reveal
ar: اضغط للعرض
es: Toca para mostrar
fr: Toucher pour afficher
ru: Нажмите, чтобы показать
zh_hans: 点按以显示

source: Type your message
ar: اكتب رسالتك
es: Escribe tu mensaje
fr: Tapez votre message
ru: Введите сообщение
zh_hans: 输入消息

# UPDATE_ACTION
source: Update
ar: تحديث
es: Actualizar
fr: Mettre à jour
ru: Обновить
zh_hans: 更新

# UPDATE_AVAILABLE_MESSAGE
source: Version %@ is available. Update for the latest features and fixes.
ar: الإصدار %@ متاح. حدّث للحصول على أحدث الميزات والإصلاحات.
es: La versión %@ está disponible. Actualiza para obtener las últimas funciones y correcciones.
fr: La version %@ est disponible. Mettez à jour pour profiter des dernières fonctionnalités et corrections.
ru: Доступна версия %@. Обновите для получения новых функций и исправлений.
zh_hans: 版本 %@ 现已推出。更新以获取最新功能和修复。

# UPDATE_AVAILABLE_TITLE
source: Update Available
ar: يتوفّر تحديث
es: Actualización disponible
fr: Mise à jour disponible
ru: Доступно обновление
zh_hans: 有可用更新

# UPDATE_REQUIRED_MESSAGE
source: A newer version of PastePoint is required to continue. Please update to keep sharing.
ar: يلزم إصدار أحدث من PastePoint للمتابعة. يرجى التحديث لمواصلة المشاركة.
es: Se requiere una versión más reciente de PastePoint para continuar. Actualiza para seguir compartiendo.
fr: Une version plus récente de PastePoint est requise pour continuer. Veuillez mettre à jour pour continuer à partager.
ru: Для продолжения требуется более новая версия PastePoint. Обновите приложение, чтобы продолжить обмен.
zh_hans: 需要更新版本的 PastePoint 才能继续。请更新以继续共享。

# UPDATE_REQUIRED_TITLE
source: Update Required
ar: التحديث مطلوب
es: Actualización requerida
fr: Mise à jour requise
ru: Требуется обновление
zh_hans: 需要更新

# VERIFYING_FILE
source: Verifying…
ar: جارٍ التحقق…
es: Verificando…
fr: Vérification…
ru: Проверка…
zh_hans: 正在校验…

# VERIFYING_FILES_WAIT
source: Please wait — still verifying files…
ar: يرجى الانتظار — لا يزال التحقق من الملفات جاريًا…
es: Espera, aún se están verificando los archivos…
fr: Veuillez patienter — vérification des fichiers en cours…
ru: Подождите — файлы ещё проверяются…
zh_hans: 请稍候——文件仍在校验中…

source: You
ar: أنت
es: Tú
fr: Vous
ru: Вы
zh_hans: 你
